In [41]:
import pandas as pd
import numpy as np

# NaN

* 정의되지 않은 값
    * 준비되지 않은 값
    * 결측값(수집되지 않은 값)
    * 통상 NaN은 numpy.nan을 활용

### 정상적인 데이터

In [42]:
df = pd.DataFrame([80, 93, 89]) # 홍길동의 1, 2, 3차 시험 성적
df

    0
0  80
1  93
2  89

### 결측값으로 데이터 프레임 생성

In [43]:
df_na = pd.DataFrame( [80, 93, np.nan] ) # 홍길동의 1, 2차 시험 성적, 3차 시험까지 있는데 아직 시험을 보지 않았다 라고 유추할 수 있다.
df_na

      0
0  80.0
1  93.0
2   NaN

# 결측값에 대한 연산

* 정상적인 경우

In [44]:
df.sum()

0    262
dtype: int64

* NaN이 있는 경우

In [45]:
df_na.sum() # skipna 라는 속성이 있는데 이 기본값이 True => NaN을 무시

0    173.0
dtype: float64

In [46]:
df_na.sum(skipna = False) # 모든 데이터가 준비가 된 후에 최종 연산을 하고 싶을 경우

0   NaN
dtype: float64

* 연산자를 활용한 경우

In [47]:
df_na

      0
0  80.0
1  93.0
2   NaN

* 산술연산  
  Nan과 관련된 모든 연산의 결과는 NaN이다.

In [48]:
df_na + 1

      0
0  81.0
1  94.0
2   NaN

In [49]:
df_na * 2

       0
0  160.0
1  186.0
2    NaN

In [50]:
df_na/1

      0
0  80.0
1  93.0
2   NaN

* 예외사항(연산의 결과가 NaN이 아닌 경우)

In [51]:
# 비교연산을 할 경우 True/False로만 반환한다.(True가 아닌 것은 모두 False 처리)

In [52]:
df_na>90

       0
0  False
1   True
2  False

In [38]:
df_na<0 # NaN과의 모든 비교연산의 결과는 False로 처리

       0
0  False
1  False
2  False